Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_layer_1 (InputLayer)      [(None, 100, 1)]     0                                            
__________________________________________________________________________________________________
snp_block_layer (SNPBlockLayer) (None, 6, 12)        1200        input_layer_1[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 6, 12)        156         snp_block_layer[0][0]            
__________________________________________________________________________________________________
multi_head_qkv__block_attention ((None, 6, 12), (Non 480         dense[0][0]                      
__________________________________________________________________________________________________
add (Add)                       (None, 6, 12)        0           multi_head_qkv__block_attention[0
                                                                 dense[0][0]                      
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, 6, 12)        24          add[0][0]                        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 6, 12)        156         layer_normalization[0][0]        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 6, 12)        0           dense_1[0][0]                    
                                                                 layer_normalization[0][0]        
__________________________________________________________________________________________________
activation (Activation)         (None, 6, 12)        0           add_1[0][0]                      
__________________________________________________________________________________________________
multi_head_qkv__block_attention ((None, 6, 12), (Non 480         activation[0][0]                 
                                                                 multi_head_qkv__block_attention[0
__________________________________________________________________________________________________
add_2 (Add)                     (None, 6, 12)        0           multi_head_qkv__block_attention_1
                                                                 activation[0][0]                 
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 6, 12)        24          add_2[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 6, 12)        156         layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 12)        0           dense_2[0][0]                    
                                                                 layer_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 6, 12)        0           add_3[0][0]                      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 72)           0           activation_1[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 72)           0           flatten[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           4672        dropout[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           4160        dense_3[0][0]                    
__________________________________________________________________________________________________
add_4 (Add)                     (None, 64)           0           dense_3[0][0]                    
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64)           0           add_4[0][0]                      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           4160        activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            65          activation_3[0][0]               
==================================================================================================
Total params: 15,733
Trainable params: 15,733
Non-trainable params: 0
__________________________________________________________________________________________________
