Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_layer_1 (InputLayer)     [(None, 100, 1)]     0           []                               
                                                                                                  
 zero_padding1d (ZeroPadding1D)  (None, 101, 1)      0           ['input_layer_1[0][0]']          
                                                                                                  
 locally_connected1d (LocallyCo  (None, 10, 12)      1200        ['zero_padding1d[0][0]']         
 nnected1D)                                                                                       
                                                                                                  
 dense (Dense)                  (None, 10, 12)       156         ['locally_connected1d[0][0]']    
                                                                                                  
 multi_level__block_attention (  ((None, 10, 12),    572         ['dense[0][0]']                  
 MultiLevel_BlockAttention)      (None, 10, 10))                                                  
                                                                                                  
 conv1d (Conv1D)                (None, 10, 1)        12          ['multi_level__block_attention[0]
                                                                 [0]']                            
                                                                                                  
 activation (Activation)        (None, 10, 1)        0           ['conv1d[0][0]']                 
                                                                                                  
 global_average_pooling1d (Glob  (None, 1)           0           ['conv1d[0][0]']                 
 alAveragePooling1D)                                                                              
                                                                                                  
 flatten (Flatten)              (None, 10)           0           ['activation[0][0]']             
                                                                                                  
 flatten_1 (Flatten)            (None, 1)            0           ['global_average_pooling1d[0][0]'
                                                                 ]                                
                                                                                                  
 dense_1 (Dense)                (None, 1)            11          ['flatten[0][0]']                
                                                                                                  
 add (Add)                      (None, 1)            0           ['flatten_1[0][0]',              
                                                                  'dense_1[0][0]']                
                                                                                                  
==================================================================================================
Total params: 1,951
Trainable params: 1,951
Non-trainable params: 0
__________________________________________________________________________________________________
