Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 1000, 1)]    0           []                               
                                                                                                  
 conv1d (Conv1D)                (None, 334, 64)      384         ['input_1[0][0]']                
                                                                                                  
 max_pooling1d (MaxPooling1D)   (None, 333, 64)      0           ['conv1d[0][0]']                 
                                                                                                  
 conv1d_1 (Conv1D)              (None, 333, 128)     24704       ['max_pooling1d[0][0]']          
                                                                                                  
 max_pooling1d_1 (MaxPooling1D)  (None, 332, 128)    0           ['conv1d_1[0][0]']               
                                                                                                  
 conv1d_2 (Conv1D)              (None, 332, 1)       129         ['max_pooling1d_1[0][0]']        
                                                                                                  
 reshape (Reshape)              (None, 1, 332)       0           ['conv1d_2[0][0]']               
                                                                                                  
 dense (Dense)                  (None, 1, 256)       85248       ['reshape[0][0]']                
                                                                                                  
 dense_1 (Dense)                (None, 1, 256)       65792       ['dense[0][0]']                  
                                                                                                  
 dense_2 (Dense)                (None, 1, 256)       65792       ['dense_1[0][0]']                
                                                                                                  
 dense_3 (Dense)                (None, 1, 256)       65792       ['dense_2[0][0]']                
                                                                                                  
 activation (Activation)        (None, 1, 256)       0           ['dense_3[0][0]']                
                                                                                                  
 flatten_1 (Flatten)            (None, 256)          0           ['dense_3[0][0]']                
                                                                                                  
 flatten (Flatten)              (None, 256)          0           ['activation[0][0]']             
                                                                                                  
 dense_5 (Dense)                (None, 1)            257         ['flatten_1[0][0]']              
                                                                                                  
 dense_4 (Dense)                (None, 1)            257         ['flatten[0][0]']                
                                                                                                  
 add (Add)                      (None, 1)            0           ['dense_5[0][0]',                
                                                                  'dense_4[0][0]']                
                                                                                                  
==================================================================================================
Total params: 308,355
Trainable params: 308,355
Non-trainable params: 0
__________________________________________________________________________________________________
